Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.2.150/CA80/xc32/PIC32CZ4010CA80176/startup_pic32cz4010ca80176.c
        /* .pfnCAN3_Handler         = */ (void*) CAN3_Handler,        /* 197 Control Area Network */
        /* .pfnCAN4_Handler         = */ (void*) CAN4_Handler,        /* 198 Control Area Network */
        /* .pfnCAN5_Handler         = */ (void*) CAN5_Handler,        /* 199 Control Area Network */
        /* .pvReserved200           = */ (void*) (0UL),               /* 200 Reserved */
        /* .pvReserved201           = */ (void*) (0UL),               /* 201 Reserved */
        /* .pfnETH_PRI_Q_0_Handler  = */ (void*) ETH_PRI_Q_0_Handler, /* 202 Ethernet Controller */
        /* .pfnETH_PRI_Q_1_Handler  = */ (void*) ETH_PRI_Q_1_Handler, /* 203 Ethernet Controller */
        /* .pfnETH_PRI_Q_2_Handler  = */ (void*) ETH_PRI_Q_2_Handler, /* 204 Ethernet Controller */
        /* .pfnETH_PRI_Q_3_Handler  = */ (void*) ETH_PRI_Q_3_Handler, /* 205 Ethernet Controller */
        /* .pfnETH_PRI_Q_4_Handler  = */ (void*) ETH_PRI_Q_4_Handler, /* 206 Ethernet Controller */
        /* .pfnETH_PRI_Q_5_Handler  = */ (void*) ETH_PRI_Q_5_Handler, /* 207 Ethernet Controller */
        /* .pfnSQI0_Handler         = */ (void*) SQI0_Handler,        /* 208 Polaris Serial Quad Interface SIB */
        /* .pfnSQI1_Handler         = */ (void*) SQI1_Handler,        /* 209 Polaris Serial Quad Interface SIB */
        /* .pfnTRNG_Handler         = */ (void*) TRNG_Handler,        /* 210 True Random Generator */
        /* .pfnSDMMC0_Handler       = */ (void*) SDMMC0_Handler,      /* 211 SD/MMC Host Controller */
        /* .pfnSDMMC1_Handler       = */ (void*) SDMMC1_Handler,      /* 212 SD/MMC Host Controller */
        /* .pfnUSBHS0_Handler       = */ (void*) USBHS0_Handler,      /* 213 USB High Speed */
        /* .pfnUSBHS1_Handler       = */ (void*) USBHS1_Handler,      /* 214 USB High Speed */
        /* .pvReserved215           = */ (void*) (0UL),               /* 215 Reserved */
        /* .pvReserved216           = */ (void*) (0UL),               /* 216 Reserved */
        /* .pvReserved217           = */ (void*) (0UL),               /* 217 Reserved */
        /* .pfnMLB_GENERAL_Handler  = */ (void*) MLB_GENERAL_Handler, /* 218 Media Local Bus */
        /* .pfnMLB_BUSREQ_Handler   = */ (void*) MLB_BUSREQ_Handler,  /* 219 Media Local Bus */
        /* .pvReserved220           = */ (void*) (0UL),               /* 220 Reserved */
        /* .pvReserved221           = */ (void*) (0UL)                /* 221 Reserved */
#endif
};

#pragma GCC diagnostic pop

#if (__ARM_FP==14) || (__ARM_FP==4)
/* These functions are used only when compiling with -mfloat-abi=softfp or -mfloat-abi=hard */
/* Save and restore IRQs */
typedef uint32_t irqflags_t;
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wpedantic"
static bool g_interrupt_enabled;
#pragma GCC diagnostic pop
#define cpu_irq_is_enabled()    (__get_PRIMASK() == 0)
#  define cpu_irq_enable()                             \
        do {                                           \
                g_interrupt_enabled = true;            \
                __DMB();                               \
                __enable_irq();                        \
        } while (0)
#  define cpu_irq_disable()                            \
        do {                                           \
                __disable_irq();                       \
                __DMB();                               \
                g_interrupt_enabled = false;           \
        } while (0)
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wpedantic"
__always_inline __STATIC_INLINE bool __attribute__((optimize("-O1"))) cpu_irq_is_enabled_flags(irqflags_t flags)
{
        return (flags);
}
#pragma GCC diagnostic pop
__always_inline __STATIC_INLINE void __attribute__((optimize("-O1"))) cpu_irq_restore(irqflags_t flags)
{
        if (cpu_irq_is_enabled_flags(flags))
                cpu_irq_enable();
}
__always_inline __STATIC_INLINE __attribute__((optimize("-O1"))) irqflags_t cpu_irq_save(void)
{
        volatile irqflags_t flags = cpu_irq_is_enabled();
        cpu_irq_disable();
        return flags;
}

/** Address for ARM CPACR */
#define ADDR_CPACR 0xE000ED88
/** CPACR Register */
#define REG_CPACR  (*((volatile uint32_t *)ADDR_CPACR))

/**
* \brief Enable FPU
*/
__always_inline __STATIC_INLINE void __attribute__((optimize("-O1"))) fpu_enable(void)
{
    irqflags_t flags;
    flags = cpu_irq_save();
    REG_CPACR |=  (0xFu << 20);
    __DSB();
    __ISB();
    cpu_irq_restore(flags);
}
#endif /* (__ARM_FP==14) || (__ARM_FP==4) */
 
/* Optional application-provided functions */
extern void __attribute__((weak,long_call)) _on_reset(void);
extern void __attribute__((weak,long_call)) _on_bootstrap(void);

/* Reserved for use by the MPLAB XC32 Compiler */
extern void __attribute__((weak,long_call)) __xc32_on_reset(void);
extern void __attribute__((weak,long_call)) __xc32_on_bootstrap(void);


/**
 * \brief This is the code that gets called on processor reset.
 * To initialize the device, and call the main() routine.
 */
void __attribute__((weak, optimize("-O1"), section(".text.Reset_Handler"), long_call,
                    naked, externally_visible))
Reset_Handler(void)
{

#if defined __XC32_PIC32CZ_INIT_RAM__
/* this one calls ECC_INIT for Riverside devices  It must be done as the very first thing since if we use the stack pointer before we
do this then we get a bus fault.  This ought to be done by the bootrom - this optional pass is added here in order to be able to use
some bringup parts where this is not happening   */
     PIC32CZ_RAM_Initialize();
#endif




#ifdef SCB_VTOR_TBLOFF_Msk
    uint32_t *pSrc;
#endif

#if defined (__REINIT_STACK_POINTER)
    /* Initialize SP from linker-defined _stack symbol. */
    __asm__ volatile ("ldr sp, =_stack" : : : "sp");

#ifdef SCB_VTOR_TBLOFF_Msk
    /* Buy stack for locals */
    __asm__ volatile ("sub sp, sp, #8" : : : "sp");
#endif
    __asm__ volatile ("add r7, sp, #0" : : : "r7");
#endif

    /* Call the optional application-provided _on_reset() function. */
    if (_on_reset)
      _on_reset();

    /* Reserved for use by MPLAB XC32. */
    if (__xc32_on_reset)
      __xc32_on_reset();


#if (__ARM_FP==14) || (__ARM_FP==4)
    /* Enable the FPU iff the application is built with -mfloat-abi=softfp or -mfloat-abi=hard */
    fpu_enable();
#endif



 



